{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report mapping two hero‑section UI updates to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all main frontend components, sections, hooks, and configuration files.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables, theme tokens, and dark‑mode overrides.",
  "frontend/index.html": "HTML entry point with SEO metadata, Open Graph tags, and root mount point for the React app.",
  "frontend/src/App.tsx": "Main React layout stitching together navbar, all marketing sections, and the footer.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, submission simulation, success state, and controlled inputs.",
  "frontend/src/components/MarketingFooter.tsx": "Footer containing brand info, quick links, services list, contact details, and social icons.",
  "frontend/src/components/MarketingNavbar.tsx": "Responsive navbar with scroll detection, smooth section navigation, and mobile menu toggle.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About section with a profile image, practice description, and a list of qualifications.",
  "frontend/src/components/sections/ContactSection.tsx": "Displays contact details, confidentiality notice, and a contact form layout.",
  "frontend/src/components/sections/HeroSection.tsx": "Provides a hero banner with background image, intro text, and buttons that scroll to other sections.",
  "frontend/src/components/sections/HighlightsSection.tsx": "Shows key highlights of the practice using icons and brief descriptions.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists major service categories with icons and descriptions in a card grid.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity, refetching queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context for authentication, identity loading, and login state handling.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating no backend queries are required for the marketing site.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines an extensive OKLCH-based light and dark theme with CSS variables for colors, radius, and global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider before rendering the main App component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors mapped to CSS variables, extended styles, plugins, and container settings.",
  "project_state.json": "Stores the project's state, constraints, design requirements, and feature definitions for building a professional chartered accountant website."
}