{
  "backend/main.mo": "Minimal Motoko actor with no defined functions.",
  "feature_evidence.json": "Feature evidence listing implemented frontend changes for hero background removal and about-section image replacement.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each major frontend file in the project.",
  "frontend/index.css": "Global Tailwind and OKLCH variable definitions for light/dark themes, applying base styles without hero background patterns.",
  "frontend/index.html": "App entry HTML containing SEO and Open Graph metadata and mounting the React application.",
  "frontend/src/App.tsx": "Main React layout composing navbar, all page sections, and footer in a single-page structure.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, submission simulation, error handling, and a success confirmation state.",
  "frontend/src/components/MarketingFooter.tsx": "Footer with brand info, quick links, services list, contact details, and social icons using smooth-scroll navigation.",
  "frontend/src/components/MarketingNavbar.tsx": "Responsive navbar with smooth-scroll navigation, scroll-based styling, and a mobile menu toggle.",
  "frontend/src/components/sections/AboutSection.tsx": "About section with descriptive text, qualifications list, and a square-framed profile image.",
  "frontend/src/components/sections/ContactSection.tsx": "Renders a contact page section with contact details, icons, and a contact form component.",
  "frontend/src/components/sections/HeroSection.tsx": "Implements the hero banner with headline text and buttons that scroll to contact and services sections.",
  "frontend/src/components/sections/HighlightsSection.tsx": "Displays a grid of highlight items with icons and descriptions explaining key service advantages.",
  "frontend/src/components/sections/ServicesSection.tsx": "Shows a grid of service cards with icons and detailed descriptions of accounting and compliance services.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because the marketing site requires no backend queries.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, including color and layout tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom theme extensions, and typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata listing existing features and pending requests to remove front‑page background designs and replace an image in the About section."
}