{
  "kind": "build_request",
  "title": "Remove front-page hero background designs and replace About profile image with uploaded photo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all decorative background styling from the front page (Hero section) so it displays on a plain background with no pattern, no decorative overlays, and no background image; keep the existing hero text, buttons, and scroll-to-section behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1",
          "msg-recent-2"
        ],
        "quotes": [
          "no remove the background of front page , no need of designs",
          "yes do it"
        ]
      },
      "acceptanceCriteria": [
        "On the Hero section, there is no patterned background (the `.hero-pattern` visual effect is not visible/used).",
        "On the Hero section, there is no background image rendered behind the hero content.",
        "Hero headline, subtext, CTA buttons, and smooth scroll behavior to Services/Contact still work as before.",
        "No new decorative/background design elements are introduced on the front page."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the existing image in the “About Our Practice” section with the uploaded photo, and ensure the image renders correctly in the existing square frame without breaking layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-3",
          "msg-recent-4"
        ],
        "quotes": [
          "yes existing image must be replaced",
          "add this photo in place of chartered accountant proflie"
        ]
      },
      "acceptanceCriteria": [
        "The About Our Practice section no longer uses `/assets/generated/ca-profile-placeholder.dim_800x800.png`.",
        "One of the uploaded images (IMG-20211208-WA0020~2-2.jpg, IMG-20211208-WA0020~2-3.jpg, or IMG-20211208-WA0020~2-4.jpg) is added as a static asset and used as the About image source.",
        "The About image remains square, cropped nicely (object-fit cover), and keeps the existing rounded/border/shadow styling.",
        "No other sections’ content or layout are changed."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Keep the application as a single-page marketing layout; do not introduce new routes or backend dependencies."
  ],
  "nonGoals": [
    "Adding new marketing sections, changing copy, or altering navigation structure beyond removing the hero background visuals.",
    "Implementing backend storage or image uploads via the backend (images should be served as frontend static assets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}