{
  "kind": "build_request",
  "title": "Update hero/intro background to match light-blue theme and look more professional",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Update the homepage Hero/intro section background so it visually syncs with the site’s light-blue theme and looks more formal/professional by improving the background treatment (e.g., refined overlay/gradient, opacity, and contrast) while keeping the existing hero content, layout structure, and CTA button behavior intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the background of the first page , intro page doesnt sync , ammend it a bit and choose a better background"
        ]
      },
      "acceptanceCriteria": [
        "Hero section background appearance is consistent with the site’s light-blue theme (no clashing tones) in both light and dark modes.",
        "Hero headline, subheadline, and buttons maintain strong readability/contrast over the background at common viewport sizes.",
        "No changes to hero CTA actions: “Schedule Consultation” still scrolls to the Contact section and “View Services” still scrolls to the Services section.",
        "No changes to the overall section order or navigation behavior in the page."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Replace the current hero background image with a more professional, subtle, corporate-style background image and wire it into the Hero section as a static asset (served from frontend/public/assets/generated) with an appropriate overlay so it does not overpower the text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "ammend it a bit and choose a better background",
          "do it as you feel the best , i dont have much idea , it just me very professional"
        ]
      },
      "acceptanceCriteria": [
        "A new generated background image is added under frontend/public/assets/generated and is used by the Hero section instead of the current image.",
        "The new background image is visually subtle (not busy) and supports a formal/professional Chartered Accountant look.",
        "The background image is responsive (covers the hero area without distortion) and does not introduce visible banding/artifacts behind overlay/gradient.",
        "The previous hero image is no longer referenced by the Hero section component."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add external services or backend dependencies; keep this change purely frontend/static-asset based."
  ],
  "nonGoals": [
    "Do not change site copy beyond what is required to improve hero background legibility.",
    "Do not add new sections or alter the existing page structure (Hero, About, Services, Highlights, Contact).",
    "Do not implement any backend functionality in Motoko for this request."
  ],
  "imageRequirements": {
    "required": [
      "Subtle abstract corporate background with soft light-blue/blue-gray tones, minimal shapes, gentle gradient, no text (ca-hero-bg-professional.dim_1600x900.png)"
    ],
    "edits": [
      "Replace current hero background image with a more subtle professional variant (ca-hero.dim_1600x900.png > ca-hero-bg-professional.dim_1600x900.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}